# CurtainGridOffHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..CurtainGridOffHost Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Curtain grid has left its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurtainGridOffHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainGridOffHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurtainGridOffHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace